In [1]:
%load_ext sql
import sqlite3
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [2]:
%%sql
ATTACH DATABASE 'CourseData.db' AS coursedata;

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [3]:
%%sql
SELECT *
    FROM coursedata.CLASS
    LIMIT 2

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, None, 'C01', 744, 'AC 0011', 'Introduction to Financial Accounting', 'Fall2014', 70384, 0, 31, -31, "['TF 0800am-0915am 09/02-12/08 DSB 105']"),
 (2, None, 'C02', 744, 'AC 0011', 'Introduction to Financial Accounting', 'Fall2014', 70385, 0, 31, -31, "['TF 0930am-1045am 09/02-12/08 DSB 105']")]

In [ ]:
%%sql

-- Program table
DROP TABLE IF EXISTS PROGRAM;
CREATE TABLE PROGRAM (
    Program_id INTEGER PRIMARY KEY,
    Program_code TEXT NOT NULL,
    Program_name TEXT NOT NULL
);

-- Location table
DROP TABLE IF EXISTS LOCATION;
CREATE TABLE LOCATION (
    Location_id INTEGER PRIMARY KEY,
    Location TEXT
);

-- Instructor table
DROP TABLE IF EXISTS INSTRUCTOR;
CREATE TABLE INSTRUCTOR (
    Instructor_id INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    Phone INTEGER,
    Email TEXT
);

-- Course table
DROP TABLE IF EXISTS COURSE;
CREATE TABLE COURSE (
    Course_id INTEGER PRIMARY KEY,
    CatalogID TEXT NOT NULL,
    Course_title TEXT NOT NULL, 
    Description TEXT,
    Credits REAL,
    Attributes TEXT,
    Prerequisites TEXT,
    Corequisites TEXT,
    Fees TEXT
);

-- Class table
DROP TABLE IF EXISTS CLASS;
CREATE TABLE CLASS (
    Class_id INTEGER PRIMARY KEY,
    Course_id INTEGER,
    Instructor_id INTEGER,
    Location_id INTEGER,
    Program_id INTEGER,
    Section TEXT NOT NULL,
    Catalog_year TEXT NOT NULL,
    Term TEXT NOT NULL, 
    Start TEXT NOT NULL,
    End TEXT NOT NULL,
    Day TEXT NOT NULL,
    Cap INTEGER NOT NULL,
    Act INTEGER NOT NULL,
    Rem INTEGER NOT NULL,
    FOREIGN KEY (Course_id) REFERENCES COURSE(Course_id)
    FOREIGN KEY (Instructor_id) REFERENCES INSTRUCTOR(Instuctor_id)
    FOREIGN KEY (Location_id) REFERENCES LOCATION(Location_id)
    FOREIGN KEY (Program_id) REFERENCES Program(Program_id)
);